public_html/other/opencog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Что такое OpenCog</a></li>
<li><a href="#sec-2">2. Разработчики</a></li>
<li><a href="#sec-3">3. Детали</a>
<ul>
<li><a href="#sec-3-1">3.1. Части <code>OpenCog</code> проекта</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Спонсоры</a></li>
<li><a href="#sec-5">5. Фонд OpenCog</a></li>
<li><a href="#sec-6">6. Участникам</a></li>
<li><a href="#sec-7">7. Новости</a></li>
<li><a href="#sec-8">8. Техническая и научная информация</a></li>
<li><a href="#sec-9">9. CogBuntu</a></li>
<li><a href="#sec-10">10. Концепции</a>
<ul>
<li><a href="#sec-10-1">10.1. Гиперграф</a></li>
<li><a href="#sec-10-2">10.2. Атом</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Что читать</a></li>
</ul>
</div>
</div>
<p>
OpenCog — инструмент для создания искусственного интеллекта на основе
открытого исходного кода.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Что такое OpenCog</h2>
<div class="outline-text-2" id="text-1">
<p>
OpenCog - open source Artificial General Intelligence framework,
созданный с целью проявить общий интеллект уровня человека и за его
пределами.
</p>

<p>
Т.е. "Мы предпринимаем серьезные усилия, направленные на построение
думающей машины"
</p>

<p>
А также: "У нас есть детальный план и возможность ее выполнить, и мы
осуществляем его благодаря жесткой работе шаг за шагом"
</p>

<p>
Суть задачи: "Мы не занимаемся созданием программы, которая делает
одну конкретную задачу, такие как игра в шахматы, диагностика
заболевания, или вождение автомобиля. Мы озабочены общим интеллектом
и взаимосвязанными когнитивными процессами, которые он влечет за собой."
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Разработчики</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Команда в Гонконге, работающих на применении OpenCog для
управления интеллектуальными игровыми персонажами
</li>
<li>Несколько разработчиков в США, Европе и Гонконге, работающих на
различных работодателей и применяющих OpenCog в коммерческих и
государственных проектах;
</li>
<li>Пять Google Summer of Code 2012 студентов, работающих на OpenCog;
Некоторые фантастические добровольцы-разработчики.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Детали</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>OpenCog</code>, в качестве программной основы, направлен на обеспечение
ученых и разработчиков программного обеспечения общей платформы для
создания и обменом программами искусственного
интеллекта. Долгосрочной целью OpenCog является ускорение развития
взаимовыгодного AGI.
</p>

<p>
<code>OpenCogPrime</code> является специфическим AGI дизайном, который строится
в рамках OpenCog framework. Он поставляется как довольно подробный,
комплексный проект, охватывающий все аспекты интеллекта. Гипотеза
заключается в том, что если этот проект будет полностью реализован и
опробован на разумного размера распределенной сети, результат будет
AGI системой с общим интеллектом на уровне человека и, в конечном
итоге за его пределами.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Части <code>OpenCog</code> проекта</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>OpenCog Framework (OCF)</code> предоставляет собой похожую на ОС
инфраструктуру и стабильного API, и включает в себя компоненты,
написанные на <code>C++ Templates</code> и <code>Boost</code>:
<ul class="org-ul">
<li><code>AtomSpace</code> разделяемая библиотека для быстрого представления
знаний в памяти, обеспечивает гибридные структуры данных для
интеграции и управления когнитивными и символьными знаниями.
</li>
<li><code>CogServer</code> контейнер и планировщик для подключаемых когнитивных
алгоритмов
</li>
</ul>
</li>
<li>Различные OpenCog проекты, которые используют или связаны с OCF, в
том числе
<ul class="org-ul">
<li>Когнитивный подключаемый алгоритм <code>MOSES</code>, <code>PLN</code> и другие;
</li>
<li>Интерфейсы и прокси-серверы, например <code>CogBot</code>, интерфейс для <code>OpenSim</code>
</li>
<li>Комплексная обработка естественного языка, вместе с его
самостоятельными, но тесно сочетающимися проектами, например <code>RelEx</code>
и <code>Link Grammar</code>
</li>
<li><code>Embodiment</code> содержит код для подключения ОС к виртуальным мирам и
созданию виртуального питомца и гуманоидного агента
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Спонсоры</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>Фонд Singularity Institute for Artificial Intelligence</code> является
основным спонсором и источником финансирования.
</li>
<li><code>Novamente LLC</code> является спонсором, основными источником кадров и
других ресурсов.
</li>
<li><code>Google Inc.</code> обеспечивает финансовую поддержку для OpenCog
программистов через Google Summer of Code в 2008 и 2009 годах.
</li>
<li><code>Xiamen</code> университет, Китай сделал некоторые работы по OpenCog в
2009-2011 годах финансируемое китайским правительством.
</li>
<li>Фонд <code>Hong Kong SAR's Innovation and Technology</code> и Гонконгский
политехнический университет (Hong Kong Polytechnic University).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Фонд OpenCog</h2>
<div class="outline-text-2" id="text-5">
<p>
OpenCog является open-source проектом, а не формальной организацией. А
также некоммерческая организация OpenCog Foundation, в частности,
посвящена содействию исследованиям и разработкам OpenCog.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Участникам</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>OpenCog список адресов электронной почты, в группе Google
<a href="https://groups.google.com/forum/?fromgroups#!overview">https://groups.google.com/forum/?fromgroups#!overview</a>
</li>
<li>Скачать OpenCog в Github
<a href="https://github.com/opencog/opencog">https://github.com/opencog/opencog</a>
</li>
<li>Сборка OpenCog, т.е. компиляция исходного кода.
<a href="http://wiki.opencog.org/w/Building_OpenCog">http://wiki.opencog.org/w/Building_OpenCog</a>
</li>
<li>Начало работы с OpenCog для разработчиков
<a href="http://wiki.opencog.org/w/Getting_Started">http://wiki.opencog.org/w/Getting_Started</a>
</li>
<li>IRC канал OpenCog на freenode #opencog… используйте ваш любимый
IRC-клиент или IRC.freenode.net
<a href="http://webchat.freenode.net/?channels=opencog">http://webchat.freenode.net/?channels=opencog</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Новости</h2>
<div class="outline-text-2" id="text-7">
<p>
Есть два источника новостей о OpenCog проекте:
</p>

<ul class="org-ul">
<li>Блог OpenCog Brainwave, время от времни участники OpenCog
рассказывают об их технических работах, которые в процессе или
завершены;
<a href="http://blog.opencog.org/">http://blog.opencog.org/</a>
</li>
<li>OpenCog Foundation News — RSS новости от сайта организации OpenCog
фонда.
<a href="http://opencog.org/feed/">http://opencog.org/feed/</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Техническая и научная информация</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Краткий обзор OpenCog разработки программного обеспечения.
<a href="http://wiki.opencog.org/w/Development">http://wiki.opencog.org/w/Development</a>
</li>
<li>Глоссарий OpenCog терминов.
<a href="http://wiki.opencog.org/w/OpenCogGlossary">http://wiki.opencog.org/w/OpenCogGlossary</a>
</li>
<li>Primer on OpenCog Node and Link types, краткий обзор OpenCog
текущего явного языка представления знаний.
<a href="http://wiki.opencog.org/w/OpenCogAtomTypes">http://wiki.opencog.org/w/OpenCogAtomTypes</a>
</li>
<li>Обзорная бумага, описывая CogPrime дизайн для продвинутых AGI,
благодаря чему OpenCog codebase в настоящее время частично
реализуется.
<a href="http://wiki.opencog.org/w/CogPrime_Overview">http://wiki.opencog.org/w/CogPrime_Overview</a>
</li>
<li>Проект wikibook на OpenCog Prime AGI дизайн, будет устаревшим до
тех пор пока книга Building Better Minds, наконец, не выйдет в
конце 2012 года. Заметьте, это содержит несколько устаревший
материал и не всегда удобно. Новичкам, вместо этого, рекомендуется
ознакомиться с CogPrime Overview. Но Wikibook содержит более
глубокое и детальное описание.
<a href="http://wiki.opencog.org/w/OpenCogPrime:WikiBook">http://wiki.opencog.org/w/OpenCogPrime:WikiBook</a>
</li>
<li>Список Идей для будущего развития, и перечень Проектных
Предложений (нет веской причины, почему это две отдельных
страницы, но в настоящее время так исторически сложилось).
<a href="http://wiki.opencog.org/w/Ideas">http://wiki.opencog.org/w/Ideas</a>
<a href="http://wiki.opencog.org/w/OpenCogPrime:Design_Suggestions">http://wiki.opencog.org/w/OpenCogPrime:Design_Suggestions</a>
</li>
<li>Список связанных с OpenCog публикаций, что несколько
устарели.
<a href="http://opencog.org/research/">http://opencog.org/research/</a>
</li>
<li>См. также страницу издания Бена Герцеля (Ben
Goertzel's), которая имеет много связанных с OpenCog публикаций.
<a href="http://wp.goertzel.org/?page_id=22">http://wp.goertzel.org/?page_id=22</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> CogBuntu</h2>
<div class="outline-text-2" id="text-9">
<p>
CogBuntu — это ремикс-версия Ubuntu Linux, которая включает в себя все
OpenCog основные компоненты (плюс все необходимые зависимости, такие
как библиотеки, инструменты и т.д.) предварительно установленные,
предварительно настроенные и готовые к работе!
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Концепции</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Гиперграф</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Гиперграф это расширение обычной концепции графа, позволяющей ребру
графа иметь более 2-х вершин. HyperGraphDB расширяет эту концепцию еще
больше:
</p>
<ul class="org-ul">
<li>позволяя ребру указывать на другое ребро,
</li>
<li>позволяет любому ребру или вершине иметь произвольное значение в
виде полезной нагрузки.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Атом</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Основная единица хранения в называется atom. Каждый atom имеет
произвольное значение и может указывать любое количество других
atom.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Что читать</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Что такое OpenCog и зачем: <a href="https://habrahabr.ru/post/160255/">https://habrahabr.ru/post/160255/</a>
</li>
<li>О разработчике Бене Гёрцеле: <a href="https://geektimes.ru/post/242132/">https://geektimes.ru/post/242132/</a>
</li>
<li>Основы подхода к построению универсального интеллекта:
<a href="https://geektimes.ru/post/145309/">https://geektimes.ru/post/145309/</a>
<a href="https://geektimes.ru/post/145467/">https://geektimes.ru/post/145467/</a>
</li>
<li>«Непредвзятый» универсальный алгоритмический интеллект
<a href="https://geektimes.ru/post/150056/">https://geektimes.ru/post/150056/</a>
<a href="https://geektimes.ru/post/150902/">https://geektimes.ru/post/150902/</a>
</li>
<li>Когнитивное смещение универсального интеллекта
<a href="https://geektimes.ru/post/151838/">https://geektimes.ru/post/151838/</a>
</li>
<li>Нейробиология и искусственный интеллект
<a href="http://habrahabr.ru/post/151628/">http://habrahabr.ru/post/151628/</a>
<a href="http://habrahabr.ru/post/151739/">http://habrahabr.ru/post/151739/</a>
<a href="https://geektimes.ru/post/151890/">https://geektimes.ru/post/151890/</a>
</li>
<li>Искусственный интеллект как совокупность вопросов
<a href="https://habrahabr.ru/post/151102/">https://habrahabr.ru/post/151102/</a>
</li>
<li>Алгоритмическая неразрешимость – это не препятствие для
алгоритмического ИИ
<a href="https://geektimes.ru/post/145929/">https://geektimes.ru/post/145929/</a>
</li>
<li>Модель функционального разделения сознания и бессознательного
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
